Public Attributes | List of all members
API_CurtainWallModelViewOptions Struct Reference
Project Navigator
Represents the model view options of Curtain Walls made with the Curtain Wall Tool. The entire structure is Archicad only. More...
#include <APIdefs_ViewSettings.hpp>
 Public Attributes
 char  | cwFrameDetailLevel
Detail level of Curtain Wall Frames (API_CurtainWallCompShow etc.)
 char  | cwPanelDetailLevel
Detail level of Curtain Wall Panels (API_CurtainWallCompShow_None,...Schematic, ...Simplified, ...Full)
 char  | cwJunctionDetailLevel
Detail level of Curtain Wall Junctions (API_CurtainWallCompShow_None,...Schematic, ...Simplified, ...Full)
 char  | cwAccessoryDetailLevel
Detail level of Curtain Wall Accessories (API_CurtainWallCompShow_None,...Schematic, ...Simplified, ...Full)
Detailed Description
Represents the model view options of Curtain Walls made with the Curtain Wall Tool. The entire structure is Archicad only.
Remarks
These settings correspond to the relevant items in the Document/Model View/Model View Options dialog/Curtain Wall Options page.
 Curtain Wall MVO